[
    {
        "id": "633d5153e5261999",
        "date": "04/08/2025 à 16:05",
        "title": "Les Statistiques et Trophées débarquent !",
        "content": "Préparez-vous à entrer dans l'histoire ! La plus grande mise à jour de Quiz Night Arena est arrivée, apportant avec elle deux fonctionnalités majeures qui vont révolutionner votre façon de jouer : les Statistiques de Carrière et les Trophées à Débloquer !\n\nIl ne s'agit plus seulement de gagner une partie, mais de construire votre légende. Voyons ce qui vous attend.\n\n📊 Le Panthéon : Suivez votre Carrière de Quizzeur\nUne toute nouvelle page \"/stats\" fait son apparition ! C'est votre nouveau quartier général pour la gloire, où chaque bonne réponse et chaque victoire sont désormais immortalisées.\n\nSur cette page, vous trouverez :\n\n🏆 Le Panthéon des Champions : Un classement des joueurs avec le plus grand nombre de victoires.\n\n🔥 Les Maîtres des Points : Un classement des joueurs ayant accumulé le score total le plus élevé toutes parties confondues.\n\n🧠 Les Spécialistes par Mode de Jeu : Des classements dédiés pour couronner les rois du \"Remue-Méninges\", les flèches du \"Massacre à la Sonnette\" et les stratèges de \"Stop ou la Gaffe\".\n\n🔍 Vos Stats Personnelles : Entrez votre pseudo et découvrez votre palmarès complet : nombre de parties jouées, victoires, meilleur score, et bien plus encore !\n\n🏆 La Salle des Trophées : De Nouveaux Défis à Relever !\nPour accompagner vos statistiques, nous introduisons les Trophées ! Ce sont des badges d'honneur que vous pouvez débloquer en réalisant des exploits spécifiques en jeu. Ils apparaîtront dans votre profil sur la page des statistiques.\n\nVoici la liste des trophées que vous pouvez commencer à chasser dès maintenant :\n\nTrophées de Persévérance\nPremière Victoire ! - Remportez votre première partie.\n\nVétéran du Quiz - Participez à 20 parties.\n\nChampion en Série - Accumulez 10 victoires.\n\nLégende du Quiz - Participez à 50 parties.\n\nLe Collectionneur - Atteignez un score total de 10 000 points.\n\nTrophées de Maîtrise\nMaître du Score - Obtenez un score de 500 points ou plus en une seule partie.\n\nRoi du Buzzer - Marquez plus de 100 points au total dans le mode \"Massacre à la Sonnette\".\n\nLe Cerveau - Marquez plus de 1000 points au total dans le mode \"Remue-Méninges\".\n\nLe Fin Limier - Marquez plus de 500 points au total dans le mode \"Stop ou la Gaffe\".\n\nTrophées d'Exploit\nInvincible - Enchaînez 3 victoires consécutives pour montrer qui est le patron.\n\nGrand Chelem ! - Réussissez un tour parfait dans \"Stop ou la Gaffe\" en trouvant toutes les bonnes réponses.\n\nLe Tacticien - Gagnez une partie après avoir utilisé le multiplicateur de score x2.\n\nAlors, prêt à graver votre nom dans la légende ? Consultez la nouvelle page de statistiques, découvrez vos premiers trophées et lancez-vous à la chasse aux exploits !\n\nBonne chance et bon jeu !"
    },
    {
        "id": "2de2e10fa9c445ba",
        "date": "03/08/2025 à 19:41",
        "title": "Nouveau easter egg",
        "content": "Un nouveau easter egg a été ajouté au jeu."
    },
    {
        "id": "38b295e9a039dff1",
        "date": "03/08/2025",
        "title": "Évolution Majeure du Cerveau du Jeu !",
        "content": "Le cœur de notre jeu, le serveur, a reçu une mise à jour majeure pour offrir plus de flexibilité, de nouvelles règles et de meilleures fonctionnalités d'administration. Voici les détails :\n\n* **Nouvelles Règles et Modes de Jeu :**\n- **Mode \"Mort Subite\" :** En cas d'égalité à la fin de la partie, une manche finale au buzzer est maintenant lancée pour déterminer le vainqueur.\n- **Logique du Buzzer Affinée :** Dans le mode \"Massacre à la Sonnette\", si un joueur répond mal, les autres ont maintenant la possibilité de buzzer à leur tour sur la même question.\n- **Correction de \"Stop ou la Gaffe\" :** Si un joueur trouve toutes les bonnes réponses, son tour se termine automatiquement et ses points sont validés.\n* **Nouvelles Fonctionnalités :**\n- **Système de Nouveautés (Changelog) :** Le serveur gère maintenant une page \"/changelog\" et permet à l'admin d'ajouter ou de supprimer les résumés de mise à jour."
    },
    {
        "id": "7799a07103db2d34",
        "date": "03/08/2025",
        "title": "Nouvelle Manette Joueur : Plus Moderne et Interactive !",
        "content": "L'interface de votre manette sur téléphone a été complètement repensée pour une expérience plus simple, plus belle et plus amusante. Voici les nouveautés :\n\n* **Nouveau Design Graphique :** L'interface a été entièrement modernisée avec un style plus clair, des contrastes élevés et des boutons plus grands pour une meilleure jouabilité.\n\n* **Menu d'Emojis Enrichi :** Dites adieu aux trois emojis de base ! Un nouveau bouton 😊 en haut de l'écran ouvre un menu avec 12 réactions différentes pour vous exprimer pendant la partie.\n\n* **Sélecteur de Thème ☀️/🌙 :** Tout comme l'écran principal, votre manette dispose maintenant de son propre bouton pour basculer entre les thèmes clair et sombre.\n\n* **Classement en Temps Réel :** La liste déroulante des joueurs est désormais triée par score pour que vous puissiez suivre le classement à tout moment.\n\n* **Boutons de Réponse Plus Clairs :** Les choix de réponse sont maintenant préfixés par des lettres (A, B, C...) pour une meilleure lisibilité."
    },
    {
        "id": "20cc7e30a413f371",
        "date": "03/08/2025",
        "title": "Mise à Jour Majeure de l'Écran Hôte !",
        "content": "L'interface principale du jeu (l'écran de l'hôte) a été entièrement modernisée pour une expérience plus claire et plus interactive. Voici un résumé des fonctionnalités :\n\n* **Nouvelle Apparence Graphique :** L'interface a été entièrement repensée avec un design plus percutant, utilisant des bordures franches et des couleurs vives pour une meilleure lisibilité par tous les joueurs.\n\n* **Sélecteur de Thème ☀️/🌙 :** L'hôte peut désormais choisir entre un affichage clair ou sombre grâce au nouveau bouton situé en haut à droite, et le choix est sauvegardé.\n\n* **Contrôle de la Musique 🎵 :** Un bouton a été ajouté pour activer ou couper facilement la musique d'ambiance du lobby.\n\n* **Lobby Amélioré :** L'écran d'accueil affiche clairement le QR Code, le code de la salle, et une grille des joueurs connectés, mettant en valeur leurs avatars et les effets spéciaux (bordures de champion, etc.).\n\n* **Affichage de Jeu Dynamique :** Pendant la partie, l'écran affiche la barre des joueurs avec les scores, la question en cours, les réponses possibles, et gère les animations de révélation.\n\n* **Lien vers les Nouveautés :** Un lien direct vers cette page a été ajouté sur l'écran d'accueil pour que tout le monde puisse se tenir informé des dernières mises à jour."
    },
    {
        "id": "f06e207de4438505",
        "date": "03/08/2025",
        "title": "Refonte Majeure de l'Écran Principal !",
        "content": "L'interface principale du jeu a été entièrement repensée pour une expérience plus claire, plus moderne et plus agréable pour tous les joueurs ! Voici les nouveautés :\n\n* **Nouveau Design Graphique :** L'interface a été reconstruite avec un style plus percutant, utilisant des bordures franches et des couleurs vives pour une meilleure lisibilité.\n\n* **Sélecteur de Thème ☀️/🌙 :** Un bouton en haut à droite vous permet maintenant de basculer instantanément entre un thème clair et un thème sombre pour votre confort visuel.\n\n* **Contrôle de la Musique 🎵 :** Vous pouvez désormais couper ou réactiver la musique d'ambiance du lobby grâce au nouveau bouton situé à côté du sélecteur de thème.\n\n* **Page des Nouveautés :** Un lien a été ajouté sur l'écran d'accueil pour que vous puissiez consulter cette page et suivre toutes les mises à jour du jeu.\n\n* **Améliorations Visuelles :** L'affichage des avatars, des scores et des effets des easter eggs a été amélioré pour correspondre au nouveau style."
    },
    {
        "id": "ec0303e4390ddfdc",
        "date": "03/08/2025",
        "title": "RÉSUMÉ COMPLET DU PROJET",
        "content": "index (L'Écran Principal / Hôte)\nC'est l'écran principal du jeu, destiné à être affiché sur un grand écran ou partagé pour que tous les joueurs puissent le voir.\n\nLobby : Affiche un QR Code et un code de salle à 4 lettres pour permettre aux joueurs de se connecter. Il montre également en temps réel les cartes des joueurs qui rejoignent la partie.\n\nPhase de Jeu :\nAffiche une barre en haut avec les cartes de tous les joueurs, leurs scores et leurs avatars. Le joueur dont c'est le tour est mis en surbrillance.\n\nAffiche l'intitulé du thème et de la question au centre de l'écran.\n\nMontre les choix de réponse et révèle la bonne réponse après le vote.\n\nFin de Partie : Annonce le nom du gagnant et déclenche une animation de confettis.\n\nPersonnalisation :\nUn bouton en haut à droite permet de basculer entre le thème clair et le thème sombre.\n\nUn deuxième bouton permet d'activer ou de couper la musique de fond du lobby.\n\n📱 player (La Manette du Joueur)\nC'est l'interface que chaque joueur utilise sur son téléphone pour interagir avec le jeu.\n\nConnexion : Permet de voir les salles disponibles ou d'entrer un code manuellement, puis de choisir son pseudo et son avatar.\n\nInterface de Jeu :\n\nAffiche le thème et la question en cours pour garder le contexte.\n\nPrésente les boutons de réponse cliquables (A, B, C...).\n\nAffiche le gros bouton BUZZ pendant le mode \"Massacre à la Sonnette\".\n\nAffiche les boutons \"Valider mes Points\" et \"Tenter plus !\" pendant le mode \"Stop ou la Gaffe\".\n\nFeedback et Interaction :\nUn voile vert (bonne réponse) ou rouge (mauvaise réponse) s'affiche brièvement après un choix.\n\nUn menu d'emojis (accessible via un bouton 😊) permet d'envoyer 12 réactions différentes qui s'affichent sur l'écran principal.\n\nUne barre supérieure permet de voir la liste de tous les joueurs, triée par score en temps réel.\n\nPersonnalisation : Possède également son propre sélecteur de thème clair/sombre.\n"
    }
]